In [9]:
import numpy as np
import pandas as pd

In [10]:
data=pd.read_csv("F:\internship-test2-master\internship-test2-master\input\question-2/main.csv")

In [11]:
data

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [70]:
occupation =data['occupation'].unique()

In [88]:
list1=[]
for i in range(len(occupation)):
    list2=[]
    for j in range(len(data['occupation'])):
        if occupation[i] is data['occupation'][j]:
            list2.append(data['age'][j])
    list1.append(list2)

In [91]:
maximum=[]
minimum=[]
for i in list1:
    maximum.append(np.max(i))
    minimum.append(np.min(i))

In [92]:
d1= pd.DataFrame(columns= ['occupation', 'min', 'max'])

In [93]:
d1['occupation']= occupation
d1['min']= minimum
d1['max']= maximum
d1

       occupation  min  max
0      technician   21   55
1           other   13   64
2          writer   18   60
3       executive   22   69
4   administrator   21   70
5         student    7   42
6          lawyer   21   53
7        educator   23   63
8       scientist   23   55
9   entertainment   15   50
10     programmer   20   63
11      librarian   23   69
12      homemaker   20   50
13         artist   19   48
14       engineer   22   70
15      marketing   24   55
16           none   11   55
17     healthcare   22   62
18        retired   51   73
19       salesman   18   66
20         doctor   28   64